CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTEPIN_Basic:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '5', peripheral: PMC, signal: 'VDD, 5', pin_signal: VDD5}
  - {pin_num: '16', peripheral: PMC, signal: 'VDD, 16', pin_signal: VDD16}
  - {pin_num: '43', peripheral: PMC, signal: 'VDD, 44', pin_signal: VDD43}
  - {pin_num: '56', peripheral: PMC, signal: 'VDD, 57', pin_signal: VDD56}
  - {pin_num: '70', peripheral: PMC, signal: 'VDD, 71', pin_signal: VDD70}
  - {pin_num: '94', peripheral: PMC, signal: 'VDD, 95', pin_signal: VDD94}
  - {pin_num: '108', peripheral: PMC, signal: 'VDD, 109', pin_signal: VDD108}
  - {pin_num: '122', peripheral: PMC, signal: 'VDD, 123', pin_signal: VDD122}
  - {pin_num: '135', peripheral: PMC, signal: 'VDD, 136', pin_signal: VDD135}
  - {pin_num: '31', peripheral: PMC, signal: VDDA, pin_signal: VDDA}
  - {pin_num: '6', peripheral: PMC, signal: 'VSS, 6', pin_signal: VSS6}
  - {pin_num: '17', peripheral: PMC, signal: 'VSS, 17', pin_signal: VSS17}
  - {pin_num: '22', peripheral: PMC, signal: 'VSS, 22', pin_signal: VSS22}
  - {pin_num: '44', peripheral: PMC, signal: 'VSS, 45', pin_signal: VSS44}
  - {pin_num: '57', peripheral: PMC, signal: 'VSS, 58', pin_signal: VSS57}
  - {pin_num: '71', peripheral: PMC, signal: 'VSS, 72', pin_signal: VSS71}
  - {pin_num: '93', peripheral: PMC, signal: 'VSS, 94', pin_signal: VSS93}
  - {pin_num: '107', peripheral: PMC, signal: 'VSS, 108', pin_signal: VSS107}
  - {pin_num: '121', peripheral: PMC, signal: 'VSS, 122', pin_signal: VSS121}
  - {pin_num: '134', peripheral: PMC, signal: 'VSS, 135', pin_signal: VSS134}
  - {pin_num: '34', peripheral: PMC, signal: VSSA, pin_signal: VSSA}
  - {pin_num: '72', peripheral: OSC0, signal: EXTAL0, pin_signal: EXTAL0/PTA18/XB_IN7/FTM0_FLT2/FTM_CLKIN0/XB_OUT8/FTM3_CH2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_Basic
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_Basic(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA18 (pin 72) is configured as EXTAL0 */
    PORT_SetPinMux(PORTA, 18U, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTEPIN_InterMcuComm:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '1', peripheral: UART1, signal: TX, pin_signal: HSADC0B_CH16/HSADC1A_CH0/PTE0/SPI1_PCS1/UART1_TX/XB_OUT10/XB_IN11/I2C1_SDA/TRACE_CLKOUT, direction: OUTPUT,
    drive_strength: high, pull_select: up, pull_enable: enable}
  - {pin_num: '2', peripheral: UART1, signal: RX, pin_signal: HSADC0B_CH17/HSADC1A_CH1/PTE1/LLWU_P0/SPI1_SOUT/UART1_RX/XB_OUT11/XB_IN7/I2C1_SCL/TRACE_D3, drive_strength: high,
    pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_InterMcuComm
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_InterMcuComm(void)
{
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTE0 (pin 1) is configured as UART1_TX */
    PORT_SetPinMux(RTEPIN_INTERMCUCOMM_IMC_UART_TX_PORT, RTEPIN_INTERMCUCOMM_IMC_UART_TX_PIN, kPORT_MuxAlt3);

    PORTE->PCR[0] = ((PORTE->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTE1 (pin 2) is configured as UART1_RX */
    PORT_SetPinMux(RTEPIN_INTERMCUCOMM_IMC_UART_RX_PORT, RTEPIN_INTERMCUCOMM_IMC_UART_RX_PIN, kPORT_MuxAlt3);

    PORTE->PCR[1] = ((PORTE->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART1TXSRC_MASK | SIM_SOPT5_UART1RXSRC_MASK)))

                  /* UART 1 transmit data source select: UART1_TX pin. */
                  | SIM_SOPT5_UART1TXSRC(SOPT5_UART1TXSRC_UART_TX)

