CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.c
                  /* UART 1 receive data source select: UART1_RX pin. */
                  | SIM_SOPT5_UART1RXSRC(SOPT5_UART1RXSRC_UART_RX));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTEPIN_CLED:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '8', peripheral: FTM3, signal: 'CH, 0', pin_signal: HSADC1A_CH5/ADC0_SE10/ADC0_DM2/PTE5/SPI1_PCS2/UART3_RX/FLEXPWM1_A0/FTM3_CH0, direction: OUTPUT}
  - {pin_num: '9', peripheral: FTM3, signal: 'CH, 1', pin_signal: HSADC1B_CH7/ADC0_SE4a/PTE6/LLWU_P16/SPI1_PCS3/UART3_CTS_b/FLEXPWM1_B0/FTM3_CH1, direction: OUTPUT}
  - {pin_num: '10', peripheral: FTM3, signal: 'CH, 2', pin_signal: PTE7/UART3_RTS_b/FLEXPWM1_A1/FTM3_CH2, direction: OUTPUT}
  - {pin_num: '11', peripheral: FTM3, signal: 'CH, 3', pin_signal: PTE8/UART5_TX/FLEXPWM1_B1/FTM3_CH3, direction: OUTPUT}
  - {pin_num: '12', peripheral: FTM3, signal: 'CH, 4', pin_signal: PTE9/LLWU_P17/UART5_RX/FLEXPWM1_A2/FTM3_CH4, direction: OUTPUT}
  - {pin_num: '13', peripheral: FTM3, signal: 'CH, 5', pin_signal: PTE10/LLWU_P18/UART5_CTS_b/FLEXPWM1_B2/FTM3_CH5, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_CLED
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_CLED(void)
{
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTE10 (pin 13) is configured as FTM3_CH5 */
    PORT_SetPinMux(RTEPIN_CLED_CLED_RB_PORT, RTEPIN_CLED_CLED_RB_PIN, kPORT_MuxAlt6);

    /* PORTE5 (pin 8) is configured as FTM3_CH0 */
    PORT_SetPinMux(RTEPIN_CLED_CLED_LR_PORT, RTEPIN_CLED_CLED_LR_PIN, kPORT_MuxAlt6);

    /* PORTE6 (pin 9) is configured as FTM3_CH1 */
    PORT_SetPinMux(RTEPIN_CLED_CLED_LG_PORT, RTEPIN_CLED_CLED_LG_PIN, kPORT_MuxAlt6);

    /* PORTE7 (pin 10) is configured as FTM3_CH2 */
    PORT_SetPinMux(RTEPIN_CLED_CLED_LB_PORT, RTEPIN_CLED_CLED_LB_PIN, kPORT_MuxAlt6);

    /* PORTE8 (pin 11) is configured as FTM3_CH3 */
    PORT_SetPinMux(RTEPIN_CLED_CLED_RR_PORT, RTEPIN_CLED_CLED_RR_PIN, kPORT_MuxAlt6);

    /* PORTE9 (pin 12) is configured as FTM3_CH4 */
    PORT_SetPinMux(RTEPIN_CLED_CLED_RG_PORT, RTEPIN_CLED_CLED_RG_PIN, kPORT_MuxAlt6);

    SIM->SOPT8 =
        ((SIM->SOPT8 &
          /* Mask bits to zero which are setting */
          (~(SIM_SOPT8_FTM3OCH0SRC_MASK | SIM_SOPT8_FTM3OCH1SRC_MASK | SIM_SOPT8_FTM3OCH2SRC_MASK | SIM_SOPT8_FTM3OCH3SRC_MASK | SIM_SOPT8_FTM3OCH4SRC_MASK | SIM_SOPT8_FTM3OCH5SRC_MASK)))

         /* FTM3 channel 0 output source: FTM3_CH0 pin is output of FTM3 channel 0 output. */
         | SIM_SOPT8_FTM3OCH0SRC(SOPT8_FTM3OCH0SRC_FTM)

         /* FTM3 channel 1 output source: FTM3_CH1 pin is output of FTM3 channel 1 output. */
         | SIM_SOPT8_FTM3OCH1SRC(SOPT8_FTM3OCH1SRC_FTM)

         /* FTM3 channel 2 output source: FTM3_CH2 pin is output of FTM3 channel 2 output. */
         | SIM_SOPT8_FTM3OCH2SRC(SOPT8_FTM3OCH2SRC_FTM)

         /* FTM3 channel 3 output source: FTM3_CH3 pin is output of FTM3 channel 3 output. */
         | SIM_SOPT8_FTM3OCH3SRC(SOPT8_FTM3OCH3SRC_FTM)

         /* FTM3 channel 4 output source: FTM3_CH4 pin is output of FTM3 channel 4 output. */
         | SIM_SOPT8_FTM3OCH4SRC(SOPT8_FTM3OCH4SRC_FTM)

         /* FTM3 channel 5 output source: FTM3_CH5 pin is output of FTM3 channel 5 output. */
         | SIM_SOPT8_FTM3OCH5SRC(SOPT8_FTM3OCH5SRC_FTM));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTEPIN_EMAG:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '18', peripheral: HSADC0, signal: 'ADCA, CH0', pin_signal: HSADC0A_CH0/ADC0_SE1/ADC0_DP1/PTE16/SPI0_PCS0/UART2_TX/FTM_CLKIN0/FTM0_FLT3}
  - {pin_num: '19', peripheral: HSADC0, signal: 'ADCA, CH1', pin_signal: HSADC0A_CH1/ADC0_SE9/ADC0_DM1/PTE17/LLWU_P19/SPI0_SCK/UART2_RX/FTM_CLKIN1/LPTMR0_ALT3}
  - {pin_num: '20', peripheral: HSADC0, signal: 'ADCB, CH0', pin_signal: HSADC0B_CH0/ADC0_SE5a/PTE18/LLWU_P20/SPI0_SOUT/UART2_CTS_b/I2C0_SDA}
  - {pin_num: '21', peripheral: HSADC0, signal: 'ADCB, CH1', pin_signal: HSADC0B_CH1/ADC0_SE6a/PTE19/SPI0_SIN/UART2_RTS_b/I2C0_SCL/CMP3_OUT}
  - {pin_num: '27', peripheral: HSADC1, signal: 'ADCA, CH2', pin_signal: HSADC0A_CH2/HSADC1A_CH2}
  - {pin_num: '28', peripheral: HSADC1, signal: 'ADCA, CH3', pin_signal: HSADC0A_CH3/HSADC1A_CH3}
  - {pin_num: '29', peripheral: HSADC1, signal: 'ADCB, CH2', pin_signal: HSADC0A_CH10/HSADC1B_CH2}
  - {pin_num: '30', peripheral: HSADC1, signal: 'ADCB, CH3', pin_signal: HSADC0A_CH11/HSADC1B_CH3}
  - {pin_num: '23', peripheral: HSADC0, signal: 'ADCA, CH6', pin_signal: HSADC0A_CH6/ADC0_SE7a}
  - {pin_num: '24', peripheral: HSADC0, signal: 'ADCA, CH7', pin_signal: HSADC0A_CH7/ADC0_SE4b}
  - {pin_num: '25', peripheral: HSADC0, signal: 'ADCA, CH8', pin_signal: HSADC0A_CH8/ADC0_SE5b/PTE20/FTM1_CH0/UART0_TX/FTM1_QD_PHA}
  - {pin_num: '26', peripheral: HSADC0, signal: 'ADCA, CH9', pin_signal: HSADC0A_CH9/HSADC1A_CH7/PTE21/XB_IN9/FTM1_CH1/UART0_RX/FTM1_QD_PHB}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_EMAG
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_EMAG(void)
{
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTE16 (pin 18) is configured as HSADC0A_CH0 */
    PORT_SetPinMux(RTEPIN_EMAG_EMAG_EWL_PORT, RTEPIN_EMAG_EMAG_EWL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE17 (pin 19) is configured as HSADC0A_CH1 */
    PORT_SetPinMux(RTEPIN_EMAG_EMAG_EXL_PORT, RTEPIN_EMAG_EMAG_EXL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE18 (pin 20) is configured as HSADC0B_CH0 */
    PORT_SetPinMux(RTEPIN_EMAG_EMAG_EWR_PORT, RTEPIN_EMAG_EMAG_EWR_PIN, kPORT_PinDisabledOrAnalog);

