CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.c
    gpio_pin_config_t TOF0_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA8 (pin 60)  */
    GPIO_PinInit(RTEPIN_TOFSENSOR_TOF0_INT_GPIO, RTEPIN_TOFSENSOR_TOF0_INT_PIN, &TOF0_INT_config);

    gpio_pin_config_t TOF1_XHT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA9 (pin 61)  */
    GPIO_PinInit(RTEPIN_TOFSENSOR_TOF1_XHT_GPIO, RTEPIN_TOFSENSOR_TOF1_XHT_PIN, &TOF1_XHT_config);

    gpio_pin_config_t TOF1_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA10 (pin 62)  */
    GPIO_PinInit(RTEPIN_TOFSENSOR_TOF1_INT_GPIO, RTEPIN_TOFSENSOR_TOF1_INT_PIN, &TOF1_INT_config);

    gpio_pin_config_t TOF2_XHT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA11 (pin 63)  */
    GPIO_PinInit(RTEPIN_TOFSENSOR_TOF2_XHT_GPIO, RTEPIN_TOFSENSOR_TOF2_XHT_PIN, &TOF2_XHT_config);

    gpio_pin_config_t TOF2_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA12 (pin 64)  */
    GPIO_PinInit(RTEPIN_TOFSENSOR_TOF2_INT_GPIO, RTEPIN_TOFSENSOR_TOF2_INT_PIN, &TOF2_INT_config);

    /* PORTA10 (pin 62) is configured as PTA10 */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOF1_INT_PORT, RTEPIN_TOFSENSOR_TOF1_INT_PIN, kPORT_MuxAsGpio);

    /* PORTA11 (pin 63) is configured as PTA11 */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOF2_XHT_PORT, RTEPIN_TOFSENSOR_TOF2_XHT_PIN, kPORT_MuxAsGpio);

    /* PORTA12 (pin 64) is configured as PTA12 */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOF2_INT_PORT, RTEPIN_TOFSENSOR_TOF2_INT_PIN, kPORT_MuxAsGpio);

    /* PORTA13 (pin 65) is configured as I2C1_SDA */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOFn_SDA_PORT, RTEPIN_TOFSENSOR_TOFn_SDA_PIN, kPORT_MuxAlt8);

    PORTA->PCR[13] = ((PORTA->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTA14 (pin 66) is configured as I2C1_SCL */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOFn_SCL_PORT, RTEPIN_TOFSENSOR_TOFn_SCL_PIN, kPORT_MuxAlt8);

    PORTA->PCR[14] = ((PORTA->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTA7 (pin 59) is configured as PTA7 */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOF0_XHT_PORT, RTEPIN_TOFSENSOR_TOF0_XHT_PIN, kPORT_MuxAsGpio);

    /* PORTA8 (pin 60) is configured as PTA8 */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOF0_INT_PORT, RTEPIN_TOFSENSOR_TOF0_INT_PIN, kPORT_MuxAsGpio);

    /* PORTA9 (pin 61) is configured as PTA9 */
    PORT_SetPinMux(RTEPIN_TOFSENSOR_TOF1_XHT_PORT, RTEPIN_TOFSENSOR_TOF1_XHT_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTEPIN_ImuTcsSensor:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '79', peripheral: GPIOA, signal: 'GPIO, 28', pin_signal: PTA28/MII0_TXER/FB_A25, direction: INPUT}
  - {pin_num: '80', peripheral: GPIOA, signal: 'GPIO, 29', pin_signal: PTA29/MII0_COL/FB_A24, direction: INPUT}
  - {pin_num: '81', peripheral: I2C0, signal: SCL, pin_signal: HSADC0B_CH2/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX/RMII0_MDIO/MII0_MDIO, identifier: IMU_SCL,
    open_drain: enable, drive_strength: high, pull_select: up, pull_enable: enable}
  - {pin_num: '82', peripheral: I2C0, signal: SDA, pin_signal: HSADC0B_CH3/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX/RMII0_MDC/MII0_MDC, identifier: IMU_SDA,
    open_drain: enable, drive_strength: high, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_ImuTcsSensor
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_ImuTcsSensor(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t TCS_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA28 (pin 79)  */
    GPIO_PinInit(RTEPIN_IMUTCSSENSOR_TCS_INT_GPIO, RTEPIN_IMUTCSSENSOR_TCS_INT_PIN, &TCS_INT_config);

    gpio_pin_config_t IMU_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA29 (pin 80)  */
    GPIO_PinInit(RTEPIN_IMUTCSSENSOR_IMU_INT_GPIO, RTEPIN_IMUTCSSENSOR_IMU_INT_PIN, &IMU_INT_config);

