CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.c
    /* PORTA28 (pin 79) is configured as PTA28 */
    PORT_SetPinMux(RTEPIN_IMUTCSSENSOR_TCS_INT_PORT, RTEPIN_IMUTCSSENSOR_TCS_INT_PIN, kPORT_MuxAsGpio);

    /* PORTA29 (pin 80) is configured as PTA29 */
    PORT_SetPinMux(RTEPIN_IMUTCSSENSOR_IMU_INT_PORT, RTEPIN_IMUTCSSENSOR_IMU_INT_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 81) is configured as I2C0_SCL */
    PORT_SetPinMux(RTEPIN_IMUTCSSENSOR_IMU_SCL_PORT, RTEPIN_IMUTCSSENSOR_IMU_SCL_PIN, kPORT_MuxAlt2);

    PORTB->PCR[0] =
        ((PORTB->PCR[0] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

         /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE
          * field is set. */
         | (uint32_t)(kPORT_PullUp)

         /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is configured as
          * a digital output. */
         | PORT_PCR_ODE(kPORT_OpenDrainEnable)

         /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin is
          * configured as a digital output. */
         | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTB1 (pin 82) is configured as I2C0_SDA */
    PORT_SetPinMux(RTEPIN_IMUTCSSENSOR_IMU_SDA_PORT, RTEPIN_IMUTCSSENSOR_IMU_SDA_PIN, kPORT_MuxAlt2);

    PORTB->PCR[1] =
        ((PORTB->PCR[1] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

         /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE
          * field is set. */
         | (uint32_t)(kPORT_PullUp)

         /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is configured as
          * a digital output. */
         | PORT_PCR_ODE(kPORT_OpenDrainEnable)

         /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin is
          * configured as a digital output. */
         | PORT_PCR_DSE(kPORT_HighDriveStrength));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTEPIN_Switch:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '144', peripheral: GPIOD, signal: 'GPIO, 15', pin_signal: PTD15/SPI2_PCS1/FLEXPWM0_B0/FB_A23, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '143', peripheral: GPIOD, signal: 'GPIO, 14', pin_signal: PTD14/SPI2_SIN/XB_IN11/XB_OUT11/FLEXPWM0_A0/FB_A22, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '142', peripheral: GPIOD, signal: 'GPIO, 13', pin_signal: PTD13/SPI2_SOUT/XB_IN7/XB_OUT7/FLEXPWM0_B1/FB_A21, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '141', peripheral: GPIOD, signal: 'GPIO, 12', pin_signal: PTD12/SPI2_SCK/FTM3_FLT0/XB_IN5/XB_OUT5/FLEXPWM0_A1/FB_A20, direction: INPUT, pull_select: up,
    pull_enable: enable}
  - {pin_num: '140', peripheral: GPIOD, signal: 'GPIO, 11', pin_signal: PTD11/LLWU_P25/SPI2_PCS0/UART5_CTS_b/FLEXPWM0_B2/FB_A19, direction: INPUT, pull_select: up,
    pull_enable: enable}
  - {pin_num: '139', peripheral: GPIOD, signal: 'GPIO, 10', pin_signal: PTD10/UART5_RTS_b/FLEXPWM0_A2/FB_A18, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '138', peripheral: GPIOD, signal: 'GPIO, 9', pin_signal: PTD9/I2C1_SDA/UART5_TX/FLEXPWM0_B3/FB_A17, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '137', peripheral: GPIOD, signal: 'GPIO, 8', pin_signal: PTD8/LLWU_P24/I2C1_SCL/UART5_RX/FLEXPWM0_A3/FB_A16, direction: INPUT, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_Switch
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_Switch(void)
{
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    gpio_pin_config_t KEY_SW07_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD8 (pin 137)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW07_GPIO, RTEPIN_SWITCH_KEY_SW07_PIN, &KEY_SW07_config);

    gpio_pin_config_t KEY_SW00_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD9 (pin 138)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW00_GPIO, RTEPIN_SWITCH_KEY_SW00_PIN, &KEY_SW00_config);

    gpio_pin_config_t KEY_SW06_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD10 (pin 139)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW06_GPIO, RTEPIN_SWITCH_KEY_SW06_PIN, &KEY_SW06_config);

    gpio_pin_config_t KEY_SW01_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD11 (pin 140)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW01_GPIO, RTEPIN_SWITCH_KEY_SW01_PIN, &KEY_SW01_config);

    gpio_pin_config_t KEY_SW05_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin 141)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW05_GPIO, RTEPIN_SWITCH_KEY_SW05_PIN, &KEY_SW05_config);

    gpio_pin_config_t KEY_SW02_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin 142)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW02_GPIO, RTEPIN_SWITCH_KEY_SW02_PIN, &KEY_SW02_config);

    gpio_pin_config_t KEY_SW04_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 143)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW04_GPIO, RTEPIN_SWITCH_KEY_SW04_PIN, &KEY_SW04_config);

    gpio_pin_config_t KEY_SW03_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 144)  */
    GPIO_PinInit(RTEPIN_SWITCH_KEY_SW03_GPIO, RTEPIN_SWITCH_KEY_SW03_PIN, &KEY_SW03_config);

    /* PORTD10 (pin 139) is configured as PTD10 */
    PORT_SetPinMux(RTEPIN_SWITCH_KEY_SW06_PORT, RTEPIN_SWITCH_KEY_SW06_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[10] = ((PORTD->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTD11 (pin 140) is configured as PTD11 */
    PORT_SetPinMux(RTEPIN_SWITCH_KEY_SW01_PORT, RTEPIN_SWITCH_KEY_SW01_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[11] = ((PORTD->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTD12 (pin 141) is configured as PTD12 */
    PORT_SetPinMux(RTEPIN_SWITCH_KEY_SW05_PORT, RTEPIN_SWITCH_KEY_SW05_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[12] = ((PORTD->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTD13 (pin 142) is configured as PTD13 */
    PORT_SetPinMux(RTEPIN_SWITCH_KEY_SW02_PORT, RTEPIN_SWITCH_KEY_SW02_PIN, kPORT_MuxAsGpio);

